# 给定一个长度为 n 的整数数组 height 。有 n 条垂线，第 i 条线的两个端点是 (i, 0) 和 (i, height[i]) 。

# 找出其中的两条线，使得它们与 x 轴共同构成的容器可以容纳最多的水。

# 返回容器可以储存的最大水量。

# 说明：你不能倾斜容器。

# 双指针算法：时间复杂度 O(n)，空间复杂度 O(1)
def maxArea(height: list[int]) -> int:
    left, right = 0, len(height) - 1
    max_water = 0
    
    while left < right:
        width = right - left
        h = min(height[left], height[right])
        max_water = max(max_water, width * h)
        
        # 移动较短的那一侧，因为移动较长的一侧只会让宽度变小，高度不会增加
        if height[left] < height[right]:
            left += 1
        else:
            right -= 1
    
    return max_water

case1 = [1,8,6,2,5,4,8,3,7]
print(f"case1 结果: {maxArea(case1)}")  # 预期: 49

case2 = [76,155,15,188,180,154,84,34,187,142,22,5,27,183,111,128,50,58,2,112,179,2,100,111,115,76,134,120,118,103,31,146,58,198,134,38,104,170,25,92,112,199,49,140,135,160,20,185,171,23,98,150,177,198,61,92,26,147,164,144,51,196,42,109,194,177,100,99,99,125,143,12,76,192,152,11,152,124,197,123,147,95,73,124,45,86,168,24,34,133,120,85,81,163,146,75,92,198,126,191]
print(f"case2 结果: {maxArea(case2)}")  # 预期: 18720